RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_smartio.h
/***************************************************************************//**
* \file cy_smartio.h
* \version 1.0.2
*
* \brief
* Provides an API declaration of the Smart I/O driver
*
********************************************************************************
* \copyright
* Copyright 2018-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_smartio
* \{
* The Smart I/O driver provides an API to configure and access the Smart I/O hardware
* present between the GPIOs (pins) and HSIOMs (pin muxes) on select device ports.
*
* The functions and other declarations used in this driver are in cy_smartio.h.
* You can include cy_pdl.h to get access to all functions
* and declarations in the PDL.
*
* It can be used to perform simple logic operations on peripheral and GPIO signals at
* the GPIO port. Features include,
*
* 1. Purely combinatorial logic using 8 Look-Up Tables (LUT).
* 2. Mixed sequential and combinatorial logic using 8 LUTs and 1 Data Unit (DU).
* 3. Counters and shift registers using 8-bit multi-function DU (simplified ALU).
* 4. Operational in device active, sleep and deep-sleep power modes.
*
* \section group_smartio_configuration Configuration Considerations
*
* \subsection group_smartio_routing_fabric Routing Fabric
*
* The Smart I/O routing fabric is divided into two portions, where each portion is capable
* of accepting half of the data or GPIO signals. The LUTs have the following structure.
*
* - LUT 7...4 are capable of accepting signals from io/chip 7...4 as inputs.
* - LUT 3...0 are capable of accepting signals from io/chip 3...0 as inputs.
* - The LUTs can accept any LUT output as an input.
* - Each LUT output is dedicated to the corresponding output io/chip terminal. For
*   example, LUT 0 can go to either io0 terminal output or chip0 terminal output or both.
*
* \subsection group_smartio_single_lut Single Source LUT Input
*
* If a LUT is used, all three inputs to the LUT must be designated. For example, even If a LUT is
* used to accept a single source as its input, all three inputs must accept that same signal. The
* lookup table should then be designed such that it only changes the output value when all
* three inputs satisfy the same condition. For example, consider the case where the signal on
* data0 must be inverted before being passed to io0. LUT0 accepts chip0 as input 0, 1 and 2.
* The truth table is defined such that it outputs a logic 1 only when the inputs are all 0.
*
* \subsection group_smartio_clk_rst Clock and Reset Behavior
*
* The Smart I/O hardware drives its synchronous elements using a single clock source.
* Depending on the clock source, the Smart I/O will have different reset behaviors, which
* will reset all the flip-flops in the LUTs and synchronizers to logic 0. The configuration
* registers will retain their values unless coming out of Power on Reset (POR). Notes:
*
* - If the block is only disabled, the values in the LUT flip-flips and I/O synchronizers are
*   held as long as the chip remains in a valid power mode.
* - The selected clock for the fabric's synchronous logic is not phase aligned with other
*   synchronous logic on the chip operating on the same clock. Therefore, communication between
*   the Smart I/O and other synchronous logic should be treated as asynchronous (just as the
*   communication between I/O input signals and other synchronous logic should be treated as
*   asynchronous)
*
* <table class="doxtable">
*   <tr>
*     <th>Clock Source</th>
*     <th>Reset Behavior</th>
*     <th>Enable Delay</th>
*     <th>Description</th>
*   </tr>
*   <tr>
*     <td>io/chip 7...0</td>
*     <td>Reset on POR</td>
*     <td>2 clock edges</td>
*     <td>If chosen as the clock source, that particular signal cannot also be used as an input
*         to a LUT as it may cause a race condition. The fabric will be enabled after 2 clock
*         edges of the signal on the gpio terminal.</td>
*   </tr>
*   <tr>
*     <td>Divided Clock (Active)</td>
*     <td>Reset when going to Deep Sleep, Hibernate or POR</td>
*     <td>2 clock edges</td>
*     <td>The fabric will be enabled after 2 clock edges of the divided clock. Any synchronous
*         logic in the LUTs will be reset to 0 when in chip deep-sleep or hibernate modes.</td>
*   </tr>
*   <tr>
*     <td>Divided Clock (Deep-Sleep)</td>
*     <td>Reset when going to Hibernate or POR</td>
*     <td>2 clock edges</td>
*     <td>The fabric will be enabled after 2 clock edges of the divided clock. Any synchronous
*         logic in the LUTs will be reset to 0 when in hibernate mode.</td>
*   </tr>
*   <tr>
*     <td>Divided Clock (Hibernate)</td>
*     <td>Reset on POR</td>
*     <td>2 clock edges</td>
*     <td>The fabric will be enabled after 2 clock edges of the divided clock.</td>
*   </tr>
*   <tr>
*     <td>LFCLK</td>
*     <td>Reset when going to Hibernate and POR</td>
*     <td>2 clock edges</td>
*     <td>The fabric will be enabled after 2 clock edges of the low frequency clock (LFCLK).
*         Any synchronous logic in the LUTs will be reset to 0 when in hibernate mode.</td>
*   </tr>
*   <tr>
*     <td>Asynchronous</td>
*     <td>Reset on POR</td>
*     <td>3 clock edges of SYSCLK</td>
*     <td>The fabric will be enabled after 3 clock edges of the clk_peri source.</td>
*   </tr>
* </table>
*
* \subsection group_smartio_sync_req Signal Synchronization Requirement
*
* If any of the signals coming in through the Smart I/O terminals are meant to be used
* in sequential elements in the LUTs, the terminal synchronizer must first be used to synchronize
* that signal to the Component clock. For example, if the signal on io0 must be used in LUT0 in
* Sequential output mode, the synchronization for io0 terminal should be enabled for reliable
* operation.
*
* \subsection group_smartio_comb_feedback LUT Combinatorial Feedback
*
* Since the LUTs can be configured as purely (or partially) combinatorial elements and since they
* can chain to each other in any fashion, combinatorial timing loops can occur. This causes
* oscillations that burn power and create unpredictable behavior. If a feedback is required, the
* signals should always go through a flip-flop before feeding back. For example, the following is a
* potentially problematic design; LUT1 and LUT2 are configured in combinatorial mode, where their
* respective outputs feed into the inputs of the other. This will result in oscillations.
* To prevent it, one of the LUTs should be configured to Gated Output mode.
*
* \subsection group_smartio_lpm Low Power Mode
*
* The Smart I/O hardware is capable of operating during chip Deep-Sleep mode. The block has
* the following requirements when operating in this mode:
*
* - All sequential elements must be clocked by a valid clock in these power domains. Refer to
*   \ref group_smartio_clk_rst for more details.
* - All signals in the block (including the clock) must be less than 1 MHz when in Deep-Sleep
*   mode.
* - The hold override functionality should be enabled when entering Deep-Sleep mode.
*   This functionality should then be disabled when the chip is not in this mode.
*
* \section group_smartio_more_information More Information
*
* Refer to the technical reference manual (TRM) and the device datasheet.
*
* \section group_smartio_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0.2</td>
*     <td>Documented MISRA 2012 violations.</td>
*     <td>MISRA 2012 compliance.</td>
*   </tr>
*   <tr>
*     <td>1.0.1</td>
*     <td>Minor documentation updates.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>The initial version.</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_smartio_macros Macros
* \defgroup group_smartio_functions Functions
* \{
*   \defgroup group_smartio_functions_init       Initialization Functions
*   \defgroup group_smartio_functions_general    General Functions
*   \defgroup group_smartio_functions_lut        LUT Functions
*   \defgroup group_smartio_functions_du         Data Unit Functions
* \}
* \defgroup group_smartio_data_structures Data Structures
* \defgroup group_smartio_enums Enumerated Types
*/

