RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_smartio.h
#if !defined(CY_SMARTIO_H)
#define CY_SMARTIO_H

#include "cy_device.h"

#if (defined (CY_IP_MXS40IOSS) || (defined(CY_IP_MXS40SIOSS) && defined(SMARTIO_BASE)) || defined(CY_IP_MXS22IOSS))

#include <stdbool.h>
#include <stddef.h>
#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 12, \
'Value extracted from _FLD2VAL macro will not exceed enum range.');

/** \addtogroup group_smartio_macros
* \{
*/

/** Driver major version */
#define CY_SMARTIO_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_SMARTIO_DRV_VERSION_MINOR       0

/** SmartIO driver ID */
#define CY_SMARTIO_ID CY_PDL_DRV_ID(0x42u)

/**
* \defgroup group_smartio_channels Smart I/O channel selection
* \{
* Constants for selecting the Smart I/O channels
*/
#define CY_SMARTIO_CHANNEL_NONE 0x00u   /**< No channels */
#define CY_SMARTIO_CHANNEL0     0x01u   /**< Channel 0 (chip0 <-> io0) */
#define CY_SMARTIO_CHANNEL1     0x02u   /**< Channel 1 (chip1 <-> io1) */
#define CY_SMARTIO_CHANNEL2     0x04u   /**< Channel 2 (chip2 <-> io2) */
#define CY_SMARTIO_CHANNEL3     0x08u   /**< Channel 3 (chip3 <-> io3) */
#define CY_SMARTIO_CHANNEL4     0x10u   /**< Channel 4 (chip4 <-> io4) */
#define CY_SMARTIO_CHANNEL5     0x20u   /**< Channel 5 (chip5 <-> io5) */
#define CY_SMARTIO_CHANNEL6     0x40u   /**< Channel 6 (chip6 <-> io6) */
#define CY_SMARTIO_CHANNEL7     0x80u   /**< Channel 7 (chip7 <-> io7) */
#define CY_SMARTIO_CHANNEL_ALL  0xffu   /**< All channels */
/** \} */

/** \} group_smartio_macros */


/***************************************
*       Constants
***************************************/

/** \cond INTERNAL */
#define CY_SMARTIO_ENABLE       1UL
#define CY_SMARTIO_DISABLE      0UL
#define CY_SMARTIO_DEINIT       0UL
#define CY_SMARTIO_LUTMAX       8u
/** \endcond */

/***************************************
*       Enumerations
***************************************/
/**
* \addtogroup group_smartio_enums
* \{
*/

/**
* Smart I/O driver error codes
*/
typedef enum
{
    CY_SMARTIO_SUCCESS   = 0x00u,                                    /**< Returned successful */
    CY_SMARTIO_BAD_PARAM = CY_SMARTIO_ID | CY_PDL_STATUS_ERROR | 0x01u, /**< Bad parameter was passed */
    CY_SMARTIO_LOCKED   = CY_SMARTIO_ID | CY_PDL_STATUS_ERROR | 0x02u,  /**< Smart I/O is not disabled */
} cy_en_smartio_status_t;

/**
* Smart I/O clock selection
*/
typedef enum {
    CY_SMARTIO_CLK_IO0  = 0,    /**< Clock sourced from signal on io0 */
    CY_SMARTIO_CLK_IO1  = 1,    /**< Clock sourced from signal on io1 */
    CY_SMARTIO_CLK_IO2  = 2,    /**< Clock sourced from signal on io2 */
    CY_SMARTIO_CLK_IO3  = 3,    /**< Clock sourced from signal on io3 */
    CY_SMARTIO_CLK_IO4  = 4,    /**< Clock sourced from signal on io4 */
    CY_SMARTIO_CLK_IO5  = 5,    /**< Clock sourced from signal on io5 */
    CY_SMARTIO_CLK_IO6  = 6,    /**< Clock sourced from signal on io6 */
    CY_SMARTIO_CLK_IO7  = 7,    /**< Clock sourced from signal on io7 */
    CY_SMARTIO_CLK_CHIP0  = 8,  /**< Clock sourced from signal on chip0 */
    CY_SMARTIO_CLK_CHIP1  = 9,  /**< Clock sourced from signal on chip1 */
    CY_SMARTIO_CLK_CHIP2  = 10, /**< Clock sourced from signal on chip2 */
    CY_SMARTIO_CLK_CHIP3  = 11, /**< Clock sourced from signal on chip3 */
    CY_SMARTIO_CLK_CHIP4  = 12, /**< Clock sourced from signal on chip4 */
    CY_SMARTIO_CLK_CHIP5  = 13, /**< Clock sourced from signal on chip5 */
    CY_SMARTIO_CLK_CHIP6  = 14, /**< Clock sourced from signal on chip6 */
    CY_SMARTIO_CLK_CHIP7  = 15, /**< Clock sourced from signal on chip7 */
    CY_SMARTIO_CLK_DIVACT = 16, /**< Clock sourced from a peripheral clock divider (Active) */
    CY_SMARTIO_CLK_DIVDS  = 17, /**< Clock sourced from a peripheral clock divider (Deep-Sleep) */
    CY_SMARTIO_CLK_DIVHIB = 18, /**< Clock sourced from a peripheral clock divider (Hibernate) */
    CY_SMARTIO_CLK_LFCLK  = 19, /**< Clock sourced from LFCLK */
    CY_SMARTIO_CLK_GATED  = 20, /**< Disables the clock. Used when turning off the block */
    CY_SMARTIO_CLK_ASYNC  = 31, /**< Asynchronous operation (only allow combinatorial logic) */
}cy_en_smartio_clksrc_t;

/**
* Smart I/O LUT number
*/
typedef enum {
    CY_SMARTIO_LUT0 = 0,        /**< Look-Up-Table #0 */
    CY_SMARTIO_LUT1 = 1,        /**< Look-Up-Table #1 */
    CY_SMARTIO_LUT2 = 2,        /**< Look-Up-Table #2 */
    CY_SMARTIO_LUT3 = 3,        /**< Look-Up-Table #3 */
    CY_SMARTIO_LUT4 = 4,        /**< Look-Up-Table #4 */
    CY_SMARTIO_LUT5 = 5,        /**< Look-Up-Table #5 */
    CY_SMARTIO_LUT6 = 6,        /**< Look-Up-Table #6 */
    CY_SMARTIO_LUT7 = 7,        /**< Look-Up-Table #7 */
}cy_en_smartio_lutnum_t;

/**
* Smart I/O input trigger number
*/
typedef enum {
    CY_SMARTIO_TR0 = 0,         /**< Input trigger #0 */
    CY_SMARTIO_TR1 = 1,         /**< Input trigger #1 */
    CY_SMARTIO_TR2 = 2,         /**< Input trigger #2 */
}cy_en_smartio_trnum_t;

/**
* Smart I/O Data Unit's input "DATA" number
*/
typedef enum {
    CY_SMARTIO_DATA0 = 0,       /**< Input DATA #0 */
    CY_SMARTIO_DATA1 = 1,       /**< Input DATA #1 */
}cy_en_smartio_datanum_t;

/**
* Smart I/O LUT input trigger source
*/
typedef enum {
    CY_SMARTIO_LUTTR_DU_OUT   = 0,  /**< Data Unit output */
    CY_SMARTIO_LUTTR_LUT0_OUT = 0,  /**< LUT0 output */
    CY_SMARTIO_LUTTR_LUT1_OUT = 1,  /**< LUT1 output */
    CY_SMARTIO_LUTTR_LUT2_OUT = 2,  /**< LUT2 output */
    CY_SMARTIO_LUTTR_LUT3_OUT = 3,  /**< LUT3 output */
    CY_SMARTIO_LUTTR_LUT4_OUT = 4,  /**< LUT4 output */
    CY_SMARTIO_LUTTR_LUT5_OUT = 5,  /**< LUT5 output */
    CY_SMARTIO_LUTTR_LUT6_OUT = 6,  /**< LUT6 output */
    CY_SMARTIO_LUTTR_LUT7_OUT = 7,  /**< LUT7 output */
    CY_SMARTIO_LUTTR_CHIP0    = 8,  /**< Chip signal 0 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_CHIP4    = 8,  /**< Chip signal 4 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_CHIP1    = 9,  /**< Chip signal 1 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_CHIP5    = 9,  /**< Chip signal 5 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_CHIP2    = 10, /**< Chip signal 2 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_CHIP6    = 10, /**< Chip signal 6 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_CHIP3    = 11, /**< Chip signal 3 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_CHIP7    = 11, /**< Chip signal 7 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_IO0      = 12, /**< I/O signal 0 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_IO4      = 12, /**< I/O signal 4 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_IO1      = 13, /**< I/O signal 1 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_IO5      = 13, /**< I/O signal 5 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_IO2      = 14, /**< I/O signal 2 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_IO6      = 14, /**< I/O signal 6 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_IO3      = 15, /**< I/O signal 3 (for LUT 0,1,2,3) */
    CY_SMARTIO_LUTTR_IO7      = 15, /**< I/O signal 7 (for LUT 4,5,6,7) */
    CY_SMARTIO_LUTTR_INVALID  = 255, /**< Invalid input trigger selection */
}cy_en_smartio_luttr_t;

/**
* Smart I/O LUT opcode
*/
typedef enum {
    CY_SMARTIO_LUTOPC_COMB      = 0,    /**< Combinatorial output */
    CY_SMARTIO_LUTOPC_GATED_TR2 = 1,    /**< TR2 gated, Combinatorial output */
    CY_SMARTIO_LUTOPC_GATED_OUT = 2,    /**< Sequential (gated) output */
    CY_SMARTIO_LUTOPC_ASYNC_SR  = 3,    /**< Asynchronous Set/Reset mode */
}cy_en_smartio_lutopc_t;

/**
* Smart I/O Data Unit input trigger source
*/
typedef enum {
    CY_SMARTIO_DUTR_ZERO     = 0,   /**< Constant 0 */
    CY_SMARTIO_DUTR_ONE      = 1,   /**< Constant 1 */
    CY_SMARTIO_DUTR_DU_OUT   = 2,   /**< Data Unit output */
    CY_SMARTIO_DUTR_LUT0_OUT = 3,   /**< LUT0 output */
    CY_SMARTIO_DUTR_LUT1_OUT = 4,   /**< LUT1 output */
    CY_SMARTIO_DUTR_LUT2_OUT = 5,   /**< LUT2 output */
    CY_SMARTIO_DUTR_LUT3_OUT = 6,   /**< LUT3 output */
    CY_SMARTIO_DUTR_LUT4_OUT = 7,   /**< LUT4 output */
    CY_SMARTIO_DUTR_LUT5_OUT = 8,   /**< LUT5 output */
    CY_SMARTIO_DUTR_LUT6_OUT = 9,   /**< LUT6 output */
    CY_SMARTIO_DUTR_LUT7_OUT = 10,  /**< LUT7 output */
    CY_SMARTIO_DUTR_INVALID  = 255, /**< Invalid input trigger selected */
}cy_en_smartio_dutr_t;

/**
* Smart I/O Data Unit input "DATA" source
*/
typedef enum {
    CY_SMARTIO_DUDATA_ZERO    = 0,  /**< Constant 0 */
    CY_SMARTIO_DUDATA_CHIP    = 1,  /**< Chip signal [7:0] */
    CY_SMARTIO_DUDATA_IO      = 2,  /**< I/O signal [7:0] */
    CY_SMARTIO_DUDATA_DATAREG = 3,  /**< SMARTIO.DATA register */
}cy_en_smartio_dudata_t;

/**
* Smart I/O Data Unit opcode
*/
typedef enum {
    CY_SMARTIO_DUOPC_INCR = 1,              /**< Increment (Count up) */
    CY_SMARTIO_DUOPC_DECR = 2,              /**< Decrement (Count down) */
    CY_SMARTIO_DUOPC_INCR_WRAP = 3,         /**< Increment and wrap-around (Count up and wrap) */
    CY_SMARTIO_DUOPC_DECR_WRAP = 4,         /**< Decrement and wrap-around (Count down and wrap) */
    CY_SMARTIO_DUOPC_INCR_DECR = 5,         /**< Increment or decrement (Count up/down) */
    CY_SMARTIO_DUOPC_INCR_DECR_WRAP = 6,    /**< Increment or decrement with wrap-around (Count up/down and wrap) */
    CY_SMARTIO_DUOPC_ROR = 7,               /**< Rotate right (shift right and wrap) */
    CY_SMARTIO_DUOPC_SHR = 8,               /**< Shift right and shift data in through MSB */
    CY_SMARTIO_DUOPC_AND_OR = 9,            /**< out = ((DATA0 & DATA1) == 0) ? 0 : 1 */
    CY_SMARTIO_DUOPC_SHR_MAJ3 = 10,         /**< Majority 3 (Check if 2 out of 3 LSB bits are logic 1) */
    CY_SMARTIO_DUOPC_SHR_EQL = 11,          /**< Check for equality against DATA1. Also perform Shift right */
}cy_en_smartio_duopc_t;

/**
* Smart I/O Data Unit operation bit size
*/
typedef enum {
    CY_SMARTIO_DUSIZE_1 = 0,    /**< 1-bit size/width operand */
    CY_SMARTIO_DUSIZE_2 = 1,    /**< 2-bits size/width operand */
    CY_SMARTIO_DUSIZE_3 = 2,    /**< 3-bits size/width operand */
    CY_SMARTIO_DUSIZE_4 = 3,    /**< 4-bits size/width operand */
    CY_SMARTIO_DUSIZE_5 = 4,    /**< 5-bits size/width operand */
    CY_SMARTIO_DUSIZE_6 = 5,    /**< 6-bits size/width operand */
    CY_SMARTIO_DUSIZE_7 = 6,    /**< 7-bits size/width operand */
    CY_SMARTIO_DUSIZE_8 = 7,    /**< 8-bits size/width operand */
}cy_en_smartio_dusize_t;

/** \} group_smartio_enums */


